// Task 9.cpp : This file contains the 'main' function. Program execution begins and ends there.
//

#include <iostream>
using namespace std;

/*
Задача 9. Дадена е шахматна дъска n x m (1 ≤ m, n ≤ 20), във всяко поле
на която е написана буква. Да се напише програма, която установява
може ли да се прочете даден текст, тръгвайки от дадено поле и движейки се
само с ход на кон. Не използвайте структури от данни, различна от
двумерен масив! Всички стойности да се задават от потребителя!
*/


int main()
{
    std::cout << "Hello World!\n";
}

// Run program: Ctrl + F5 or Debug > Start Without Debugging menu
// Debug program: F5 or Debug > Start Debugging menu
